OpenFOAM-v2112/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd25
// -*- C++ -*-

stdmd25
{
    ${stdmd01}

    field          p;
    patch          outlet;
    modeSorter     kiewat;
}


// ************************************************************************* //
